src/cf/Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосударственныйОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЭкспорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПунктВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Курьер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаЗаказНаряд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ОнлайнЗаказыУНФ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

//См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки,
	Команды) Экспорт

	Если Не ОнлайнЗаказы.ОнлайнЗаказыДоступны() Тогда
		Возврат;
	КонецЕсли;
	
	Если НастройкиФормы.ЭтоФормаОбъекта Тогда
		ТипыОбъектовСУсловиемВидимости = ТипыОбъектовСУсловиемВидимости();
		УстановитьУсловиеВидимости(НастройкиФормы.ТипыИсточников, ТипыОбъектовСУсловиемВидимости, Команды);
	КонецЕсли;	
	
	ИменаИсключаемыхФорм = ИменаИсключаемыхФорм();
	ИмяФормы = НастройкиФормы.МетаданныеФормы.Имя;

	Если ИменаИсключаемыхФорм.Найти(ИмяФормы) <> Неопределено Тогда
		Возврат;
	КонецЕсли;	
			
	ИменаОснованийЗаказа = Новый Массив;
	ИнтеграцияПодсистемБИП.ПриОпределенииОснованияЗаказа(ИменаОснованийЗаказа, Неопределено);
	ОнлайнЗаказыПереопределяемый.ПриОпределенииОснованияЗаказа(ИменаОснованийЗаказа, Неопределено);
	
	ТипыОбъектов = Новый Массив;
	Для Каждого ПолноеИмя Из ИменаОснованийЗаказа Цикл
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
		ТипыОбъектов.Добавить(ТипЗнч(Менеджер.ПустаяСсылка()));
	КонецЦикла;
	Если Не ЗначениеЗаполнено(ТипыОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	ТипПараметра = Новый ОписаниеТипов(ТипыОбъектов);
	
	Команда = Команды.Добавить();
	Команда.Вид                      = "Отправить";
	Команда.Идентификатор            = "СоздатьОнлайнЗаказ";
	Команда.Представление            = НСтр("ru = 'Онлайн-заказ'");
	Команда.Важность                 = "Обычное";
	Команда.Порядок                  = 140;
	Команда.ОтображениеКнопки        = ОтображениеКнопки.Картинка;
	Команда.Картинка                 = БиблиотекаКартинок.ЛоготипОнлайнЗаказы;
	Команда.ТипПараметра             = ТипПараметра;
	Команда.Назначение               = "ДляСписка";
	Команда.ИзменяетВыбранныеОбъекты = Ложь;
	Команда.МножественныйВыбор       = Ложь;
	Команда.РежимЗаписи              = "Записывать";
	Команда.Обработчик = "ОнлайнЗаказыКлиент.Подключаемый_ОткрытьФормуURLЗаказа";
	
КонецПроцедуры

#Область СозданиеСсылки

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииОснованияЗаказа
Процедура ПриОпределенииОснованияЗаказа(ИменаОснованийЗаказа) Экспорт
	
	ИменаОснованийЗаказа.Добавить("Документ.ЗаказПокупателя");
	ИменаОснованийЗаказа.Добавить("Документ.СчетНаОплату");
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииПараметровСозданияЗаказа.
//
Процедура ПриОпределенииПараметровСозданияЗаказа(
		ДокументЗаказа,
		Результат) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументЗаказа) Тогда
		Результат.СозданиеЗаказаДоступно = Ложь;
		Результат.СообщениеОбОшибке = НСтр("ru='Документ не выбран.'");
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументЗаказа) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДокументЗаказа, "Проведен, Контрагент, Организация, ВидОперации, Представление");
		
		Если РаботаСЗаявкамиКлиентСервер.ЭтоЗаявка(ЗначенияРеквизитов.ВидОперации) Тогда
			Результат.СозданиеЗаказаДоступно = Ложь;
			Результат.СообщениеОбОшибке = РаботаСЗаявкамиКлиентСервер.СообщениеОНеобходимостиПереводаЗаявкиВЗаказ(
			ЗначенияРеквизитов.Представление);
		КонецЕсли;
		
	Иначе
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДокументЗаказа, "Проведен, Контрагент, Организация");
	КонецЕсли;
	
	Если Не ЗначенияРеквизитов.Проведен Тогда
		Результат.СозданиеЗаказаДоступно = Ложь;
		Результат.СообщениеОбОшибке =
			НСтр("ru = 'Выставление онлайн-заказов доступно только для проведенных документов.'");
	КонецЕсли;
	
	ВидКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ЗначенияРеквизитов.Контрагент,
		"ВидКонтрагента");
	

	Если ВидКонтрагента = Перечисления.ВидыКонтрагентов.ГосударственныйОрган Тогда
	
		Результат.СозданиеЗаказаДоступно = Ложь;
		Результат.СообщениеОбОшибке =
			НСтр("ru = 'Выставление онлайн-заказов не доступна для гос. органов.'");
		
	КонецЕсли;
	
	Результат.Организация = ЗначенияРеквизитов.Организация;
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриФормированииЗаказаНаОплату.
//
Процедура ПриОпределенииПечатныхФормЗаказа(ДокументЗаказа, ПечатныеФормы) Экспорт
	
	ИнтерактивныйВызовПриПечати = Новый Соответствие;
	ИнтерактивныйВызовПриПечати.Вставить("Конверт", Истина);
	
	КомандыПечатиОбъекта 		= ОнлайнЗаказы.КомандыПечатиОбъектаДоступныеДляВложений(
		ДокументЗаказа.Метаданные());
	
	Для Каждого КомандаПечатиОбъекта Из КомандыПечатиОбъекта Цикл
		
		Если КомандаПечатиОбъекта.Отключена
			Или КомандаПечатиОбъекта.СразуНаПринтер
			Или КомандаПечатиОбъекта.СкрытаФункциональнымиОпциями
			Или ПустаяСтрока(КомандаПечатиОбъекта.МенеджерПечати)
			Или ИнтерактивныйВызовПриПечати.Получить(КомандаПечатиОбъекта.Идентификатор) <> Неопределено
			Или СтрНайти(КомандаПечатиОбъекта.Представление, "(.docx)")
			Или СтрНайти(КомандаПечатиОбъекта.Идентификатор, ",") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока                    = ПечатныеФормы.Добавить();
		НоваяСтрока.Идентификатор      = КомандаПечатиОбъекта.УникальныйИдентификатор;
		НоваяСтрока.Представление      = КомандаПечатиОбъекта.Представление;
		НоваяСтрока.ФорматСохранения   = ТипФайлаТабличногоДокумента["PDF"];
		НоваяСтрока.ИмяФайлаВТранслите = Истина;
		НоваяСтрока.ПодписьИПечать     = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриНастройкеТаблицыТоваров.
//
Процедура ПриНастройкеТаблицыТоваров(ДокументЗаказа, ОписаниеПредставленияТоваров) Экспорт

	НалогообложениеНДС	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументЗаказа, "НалогообложениеНДС");
	
	ЕстьСкидка	  		= ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиНаценкиПродажи")
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки");

	ЕстьНДС			 	= НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;

	КолонкаОписание = ОнлайнЗаказы.НоваяКолонкаТовары();
	КолонкаОписание.Представление = НСтр("ru = 'Цена'");
	КолонкаОписание.Идентификатор = "Цена";
	
	ОписаниеПредставленияТоваров.Добавить(КолонкаОписание);

	Если ЕстьНДС Тогда

		КолонкаОписание = ОнлайнЗаказы.НоваяКолонкаТовары();
		КолонкаОписание.Представление = НСтр("ru = 'Всего'");
		КолонкаОписание.Идентификатор = "Всего";
		
		ОписаниеПредставленияТоваров.Добавить(КолонкаОписание);

	КонецЕсли;
	
	Для Каждого ОписаниеПредставленияТовара Из ОписаниеПредставленияТоваров Цикл
		
		Если ОписаниеПредставленияТовара.Идентификатор = "Количество" Тогда

			ОписаниеПредставленияТовара.ПорядокОтображения = 2;
			
		ИначеЕсли ОписаниеПредставленияТовара.Идентификатор = "Цена" Тогда

			ОписаниеПредставленияТовара.ПорядокОтображения = 3;
			
		ИначеЕсли ОписаниеПредставленияТовара.Идентификатор = "Скидка" Тогда

			ОписаниеПредставленияТовара.ПорядокОтображения = 4;
			ОписаниеПредставленияТовара.Видимость = ЕстьСкидка;
			
		ИначеЕсли ОписаниеПредставленияТовара.Идентификатор = "СуммаСоСкидкой" Тогда

			ОписаниеПредставленияТовара.ПорядокОтображения = 5;
			ОписаниеПредставленияТовара.Представление = НСтр("ru = 'Сумма'");
			
		ИначеЕсли ОписаниеПредставленияТовара.Идентификатор = "СуммаНДС" Тогда

			ОписаниеПредставленияТовара.ПорядокОтображения = 6;
			ОписаниеПредставленияТовара.Видимость = ЕстьНДС;
			
		ИначеЕсли ОписаниеПредставленияТовара.Идентификатор = "Всего" Тогда

			ОписаниеПредставленияТовара.ПорядокОтображения = 7;
			ОписаниеПредставленияТовара.Видимость = ЕстьНДС;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриФормированииЗаказаНаОплату.
//
Процедура ПриФормированииЗаказаНаОплату(ДокументЗаказа, ЗаказНаОплату) Экспорт
	
	Если ТипЗнч(ДокументЗаказа) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Счет на оплату"" КАК Представление,
		|	СчетНаОплату.Номер КАК Номер,
		|	СчетНаОплату.Дата КАК Дата,
		|	СчетНаОплату.ВалютаДокумента.Код КАК ВалютаДокументаКод,
		|	СчетНаОплату.СуммаДокумента КАК СуммаДокумента,
		|	СчетНаОплату.БанковскийСчет КАК БанковскийСчет,
		|	СчетНаОплату.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
		|	СчетНаОплату.Организация КАК Организация,
		|	СчетНаОплату.Контрагент КАК Контрагент,
		|	СчетНаОплату.Договор.НомерДоговора КАК НомерДоговора,
		|	СчетНаОплату.НалогообложениеНДС КАК НалогообложениеНДС,
		|	СчетНаОплату.АдресСайта КАК АдресСайта,
		|	ВЫБОР
		|		КОГДА СчетНаОплату.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ФизическоеЛицо)
		|			ТОГДА ""ФизическоеЛицо""
		|		КОГДА СчетНаОплату.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ЮридическоеЛицо)
		|		ИЛИ СчетНаОплату.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель)
		|			ТОГДА ""ЮридическоеЛицо""
		|		ИНАЧЕ """"""""
		|	КОНЕЦ КАК ТипКонтрагента,
		|	СУММА(СчетНаОплатуЗапасы.СуммаНДС) КАК СуммаНДС
		|ИЗ
		|	Документ.СчетНаОплату.Запасы КАК СчетНаОплатуЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплату КАК СчетНаОплату
		|		ПО СчетНаОплатуЗапасы.Ссылка = СчетНаОплату.Ссылка
		|ГДЕ
		|	СчетНаОплату.Ссылка = &ОснованиеПлатежа
		|СГРУППИРОВАТЬ ПО
		|	СчетНаОплату.Номер,
		|	СчетНаОплату.Дата,
		|	СчетНаОплату.ВалютаДокумента.Код,
		|	СчетНаОплату.СуммаДокумента,
		|	СчетНаОплату.БанковскийСчет,
		|	СчетНаОплату.ИдентификаторПлатежа,
		|	СчетНаОплату.Организация,
		|	СчетНаОплату.Контрагент,
		|	СчетНаОплату.Договор.НомерДоговора,
		|	СчетНаОплату.НалогообложениеНДС,
		|	СчетНаОплату.АдресСайта,
		|	ВЫБОР
		|		КОГДА СчетНаОплату.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ФизическоеЛицо)
		|			ТОГДА ""ФизическоеЛицо""
		|		КОГДА СчетНаОплату.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ЮридическоеЛицо)
		|		ИЛИ СчетНаОплату.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель)
		|			ТОГДА ""ЮридическоеЛицо""
		|		ИНАЧЕ """"""""
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Запасы.НомерСтроки КАК НомерСтроки,
		|	ВЫРАЗИТЬ(Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(250)) КАК Наименование,
		|	ВЫРАЗИТЬ(Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(250)) КАК НаименованиеПолное,
		|	ПРЕДСТАВЛЕНИЕ(Запасы.Характеристика) КАК Характеристика,
		|	Запасы.Количество КАК Количество,
		|	Запасы.Цена КАК Цена,
		|	Запасы.Номенклатура.Артикул КАК Артикул,
		|	Запасы.Номенклатура.Код КАК Код,
		|	ПРЕДСТАВЛЕНИЕ(Запасы.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|	ПРЕДСТАВЛЕНИЕ(Запасы.Номенклатура.ТипНоменклатуры) КАК ВидНоменклатуры,
		|	ПРЕДСТАВЛЕНИЕ(Запасы.Номенклатура.Родитель) КАК Родитель,
		|	Запасы.Номенклатура КАК Номенклатура,
		|	1 КАК ПредметРасчета,
		|	Запасы.Сумма КАК Сумма,
		|	Запасы.Всего КАК Всего,
		|	Запасы.СуммаНДС КАК СуммаНДС
		|ИЗ
		|	Документ.СчетНаОплату.Запасы КАК Запасы
		|ГДЕ
		|	Запасы.Ссылка = &ОснованиеПлатежа
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	0,
		|	ВЫРАЗИТЬ(СчетНаОплату.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(250)),
		|	ВЫРАЗИТЬ(СчетНаОплату.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(250)),
		|	"""",
		|	1,
		|	СчетНаОплату.СтоимостьДоставки,
		|	СчетНаОплату.НоменклатураДоставки.Артикул,
		|	СчетНаОплату.НоменклатураДоставки.Код,
		|	ПРЕДСТАВЛЕНИЕ(СчетНаОплату.НоменклатураДоставки.ЕдиницаИзмерения),
		|	ПРЕДСТАВЛЕНИЕ(СчетНаОплату.НоменклатураДоставки.ТипНоменклатуры),
		|	ПРЕДСТАВЛЕНИЕ(СчетНаОплату.НоменклатураДоставки.Родитель),
		|	СчетНаОплату.НоменклатураДоставки,
		|	1,
		|	СчетНаОплату.СтоимостьДоставки,
		|	СчетНаОплату.СтоимостьДоставки + ВЫБОР
		|		КОГДА СчетНаОплату.СуммаВключаетНДС
		|			ТОГДА 0
		|		ИНАЧЕ СчетНаОплату.СуммаНДСДоставки
		|	КОНЕЦ,
		|	СчетНаОплату.СуммаНДСДоставки
		|ИЗ
		|	Документ.СчетНаОплату КАК СчетНаОплату
		|ГДЕ
		|	СчетНаОплату.Ссылка = &ОснованиеПлатежа
		|	И СчетНаОплату.НоменклатураДоставки <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И СчетНаОплату.СтоимостьДоставки <> 0";
		
	ИначеЕсли ТипЗнч(ДокументЗаказа) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		ТекстЗапроса = 
		
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Заказ"" КАК Представление,
		|	ЗаказПокупателя.Номер КАК Номер,
		|	ЗаказПокупателя.Дата КАК Дата,
		|	ЗаказПокупателя.ВалютаДокумента.Код КАК ВалютаДокументаКод,
		|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
		|	ЗаказПокупателя.БанковскийСчет КАК БанковскийСчет,
		|	ЗаказПокупателя.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
		|	ЗаказПокупателя.Организация КАК Организация,
		|	ЗаказПокупателя.Контрагент КАК Контрагент,
		|	ЗаказПокупателя.Договор.НомерДоговора КАК НомерДоговора,
		|	ЗаказПокупателя.НалогообложениеНДС КАК НалогообложениеНДС,
		|	ЗаказПокупателя.АдресСайта КАК АдресСайта,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателя.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ФизическоеЛицо)
		|			ТОГДА ""ФизическоеЛицо""
		|		КОГДА ЗаказПокупателя.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ЮридическоеЛицо)
		|		ИЛИ
		|			ЗаказПокупателя.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель)
		|			ТОГДА ""ЮридическоеЛицо""
		|		ИНАЧЕ """"""""
		|	КОНЕЦ КАК ТипКонтрагента,
		|	СУММА(ЗаказПокупателяЗапасы.СуммаНДС) КАК СуммаНДС
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО ЗаказПокупателяЗапасы.Ссылка = ЗаказПокупателя.Ссылка
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &ОснованиеПлатежа
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателя.Номер,
		|	ЗаказПокупателя.Дата,
		|	ЗаказПокупателя.ВалютаДокумента.Код,
		|	ЗаказПокупателя.СуммаДокумента,
		|	ЗаказПокупателя.БанковскийСчет,
		|	ЗаказПокупателя.ИдентификаторПлатежа,
		|	ЗаказПокупателя.Организация,
		|	ЗаказПокупателя.Контрагент,
		|	ЗаказПокупателя.Договор.НомерДоговора,
		|	ЗаказПокупателя.НалогообложениеНДС,
		|	ЗаказПокупателя.АдресСайта,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателя.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ФизическоеЛицо)
		|			ТОГДА ""ФизическоеЛицо""
		|		КОГДА ЗаказПокупателя.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ЮридическоеЛицо)
		|		ИЛИ
		|			ЗаказПокупателя.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель)
		|			ТОГДА ""ЮридическоеЛицо""
		|		ИНАЧЕ """"""""
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Запасы.НомерСтроки КАК НомерСтроки,
		|	ВЫРАЗИТЬ(Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(250)) КАК Наименование,
		|	ВЫРАЗИТЬ(Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(250)) КАК НаименованиеПолное,
		|	ПРЕДСТАВЛЕНИЕ(Запасы.Характеристика) КАК Характеристика,
		|	Запасы.Количество КАК Количество,
		|	Запасы.Цена КАК Цена,
		|	Запасы.Номенклатура.Артикул КАК Артикул,
		|	Запасы.Номенклатура.Код КАК Код,
		|	ПРЕДСТАВЛЕНИЕ(Запасы.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|	ПРЕДСТАВЛЕНИЕ(Запасы.Номенклатура.ТипНоменклатуры) КАК ВидНоменклатуры,
		|	ПРЕДСТАВЛЕНИЕ(Запасы.Номенклатура.Родитель) КАК Родитель,
		|	Запасы.Номенклатура КАК Номенклатура,
		|	1 КАК ПредметРасчета,
		|	Запасы.Сумма КАК Сумма,
		|	Запасы.Всего КАК Всего,
		|	Запасы.СуммаНДС КАК СуммаНДС
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК Запасы
		|ГДЕ
		|	Запасы.Ссылка = &ОснованиеПлатежа
		|	И НЕ Запасы.ЭтоРазделитель
		|	И Запасы.НомерВариантаКП = Запасы.Ссылка.ОсновнойВариантКП
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Работы.НомерСтроки,
		|	ВЫРАЗИТЬ(Работы.Номенклатура.НаименованиеПолное КАК СТРОКА(250)),
		|	ВЫРАЗИТЬ(Работы.Номенклатура.НаименованиеПолное КАК СТРОКА(250)),
		|	ПРЕДСТАВЛЕНИЕ(Работы.Характеристика),
		|	Работы.Количество,
		|	Работы.Цена,
		|	Работы.Номенклатура.Артикул,
		|	Работы.Номенклатура.Код,
		|	ПРЕДСТАВЛЕНИЕ(Работы.Номенклатура.ЕдиницаИзмерения),
		|	ПРЕДСТАВЛЕНИЕ(Работы.Номенклатура.ТипНоменклатуры),
		|	ПРЕДСТАВЛЕНИЕ(Работы.Номенклатура.Родитель),
		|	Работы.Номенклатура,
		|	1,
		|	Работы.Сумма,
		|	Работы.Всего,
		|	Работы.СуммаНДС
		|ИЗ
		|	Документ.ЗаказПокупателя.Работы КАК Работы
		|ГДЕ
		|	Работы.Ссылка = &ОснованиеПлатежа
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	0,
		|	ВЫРАЗИТЬ(ЗаказПокупателя.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(250)),
		|	ВЫРАЗИТЬ(ЗаказПокупателя.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(250)),
		|	"""",
		|	1,
		|	ЗаказПокупателя.СтоимостьДоставки,
		|	ЗаказПокупателя.НоменклатураДоставки.Артикул,
		|	ЗаказПокупателя.НоменклатураДоставки.Код,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказПокупателя.НоменклатураДоставки.ЕдиницаИзмерения),
		|	ПРЕДСТАВЛЕНИЕ(ЗаказПокупателя.НоменклатураДоставки.ТипНоменклатуры),
		|	ПРЕДСТАВЛЕНИЕ(ЗаказПокупателя.НоменклатураДоставки.Родитель),
		|	ЗаказПокупателя.НоменклатураДоставки,
		|	1,
		|	ЗаказПокупателя.СтоимостьДоставки,
		|	ЗаказПокупателя.СтоимостьДоставки + ВЫБОР
		|		КОГДА ЗаказПокупателя.СуммаВключаетНДС
		|			ТОГДА 0
		|		ИНАЧЕ ЗаказПокупателя.СуммаНДСДоставки
		|	КОНЕЦ,
		|	ЗаказПокупателя.СуммаНДСДоставки
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &ОснованиеПлатежа
		|	И ЗаказПокупателя.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
		|	И ЗаказПокупателя.НоменклатураДоставки <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И ЗаказПокупателя.СтоимостьДоставки <> 0";
		
	КонецЕсли;		
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОснованиеПлатежа", ДокументЗаказа);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка 		= Результаты[0].Выбрать();
	ВыборкаНоменклатура = Результаты[1].Выбрать();
	
	// Шапка основания платежа
	Если ВыборкаШапка.Следующий() Тогда
		
		СведенияОбОрганизации = ПечатьДокументовУНФ.СведенияОЮрФизЛице(ВыборкаШапка.Организация, ВыборкаШапка.Дата,, ВыборкаШапка.БанковскийСчет);
		СведенияОКонтрагенте  = ПечатьДокументовУНФ.СведенияОЮрФизЛице(ВыборкаШапка.Контрагент, ВыборкаШапка.Дата);
		
		НомерДокумента 		  = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ВыборкаШапка.Дата, ВыборкаШапка.Номер, ВыборкаШапка.Организация.Префикс);
		
		ЗаказНаОплату.ОбщиеПараметрыЗаказа.СрокЖизни 				= ВыборкаШапка.Дата + 30 * 24 * 60 * 60; // 30 дней в минутах
		ЗаказНаОплату.ОбщиеПараметрыЗаказа.ТипКонтрагента			= ВыборкаШапка.ТипКонтрагента;
		ЗаказНаОплату.ВизуализацияЗаказа.Представление 				= СтрШаблон(
			НСтр("ru = '%3 № %1 от %2.'"), 
			НомерДокумента, 
			Формат(ВыборкаШапка.Дата, "ДЛФ=D"),
			ВыборкаШапка.Представление);

		ЗаказНаОплату.ВизуализацияЗаказа.ПоставщикПредставление 	= СокрЛП(СведенияОбОрганизации.ПолноеНаименование);
		ЗаказНаОплату.ВизуализацияЗаказа.ПоставщикЗаголовок 		= НСтр("ru = 'Продавец'");
		ЗаказНаОплату.ВизуализацияЗаказа.ПокупательПредставление 	= СокрЛП(СведенияОКонтрагенте.ПолноеНаименование);
		ЗаказНаОплату.ВизуализацияЗаказа.ПокупательЗаголовок 		= НСтр("ru = 'Покупатель'");
		
		Если ЗаказНаОплату.ПараметрыОплат.СБП <> Неопределено
			И ЗаказНаОплату.ПараметрыОплат.СБП.b2b <> Неопределено Тогда
			
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.СуммаНДС = ВыборкаШапка.СуммаНДС;
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.ОблагаетсяНДС = (ВыборкаШапка.СуммаНДС <> 0);
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.РасчетныйСчет = ВыборкаШапка.БанковскийСчет.НомерСчета;
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.ИдентификаторПлатежа = ВыборкаШапка.ИдентификаторПлатежа;
			
		КонецЕсли;
		
		ЗаказНаОплату.ПараметрыОплат.ПоРеквизитам.ДанныеQR = QRКодПоРеквизитам(ВыборкаШапка, СведенияОбОрганизации);
		
		ПредставлениеПолучателяПлатежа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1, ИНН: %2, КПП: %3'"),
			СведенияОбОрганизации.ПолноеНаименование,
			СведенияОбОрганизации.ИНН,
			СведенияОбОрганизации.КПП);
	
		ПредставлениеСчетаПолучателя = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'р/с: %1 в: %2, корр.сч: %3, БИК: %4'"),
			СведенияОбОрганизации.НомерСчета,
			СведенияОбОрганизации.Банк,
			СведенияОбОрганизации.КоррСчет,
			СведенияОбОрганизации.БИК);
		
		НазначениеПлатежа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Оплата по счету № %1 от %2. Сумма %3.'"),
			ВыборкаШапка.Номер,
			Формат(ВыборкаШапка.Дата, "ДФ=dd.MM.yyyy"),
			Формат(ВыборкаШапка.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="));
		
		ЗаказНаОплату.ПараметрыОплат.ПоРеквизитам.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1, %2, %3'"),
			ПредставлениеПолучателяПлатежа,
			ПредставлениеСчетаПолучателя,
			НазначениеПлатежа);
			
		АдресСайта = ВыборкаШапка.АдресСайта;
		
	КонецЕсли;
	
	// Табличная часть основания платежа
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		СтрокаНоменклатуры = ЗаказНаОплату.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНоменклатуры, ВыборкаНоменклатура);
		
		Если ВыборкаШапка.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
			
			СтрокаНоменклатуры.СуммаСоСкидкой 		= ВыборкаНоменклатура.Сумма;
			СтрокаНоменклатуры.Скидка 				= ?(ЗначениеЗаполнено(ВыборкаНоменклатура.Цена), 
				ВыборкаНоменклатура.Цена * ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.Сумма,
				0);
				
		Иначе
				
			СтрокаНоменклатуры.СуммаСоСкидкой 		= ВыборкаНоменклатура.Всего;
			СтрокаНоменклатуры.Скидка 				= ?(ЗначениеЗаполнено(ВыборкаНоменклатура.Цена), 
				ВыборкаНоменклатура.Цена * ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.Всего,
				0);
				
		КонецЕсли;
			
		СтрокаНоменклатуры.Наименование 		= ПечатьДокументовУНФ.ПредставлениеНоменклатурыДляПечати(
			ВыборкаНоменклатура.Номенклатура, 
			ВыборкаНоменклатура.Характеристика, 
			ВыборкаНоменклатура.Артикул);

		СтрокаНоменклатуры.ИдентификаторТовара  = СокрЛП(ВыборкаНоменклатура.Код);      
		
	КонецЦикла;
	
	Если ЗаказНаОплату.ПараметрыОплат.СБП.c2b <> Неопределено Тогда
		
		РеквизитыОплаты	  = ИнтеграцияСПлатежнымиСистемамиУНФ.НастройкиСБПОснованияПлатежа(ДокументЗаказа);
		ПараметрыОплатСБП = ?(ЗаказНаОплату.ПараметрыОплат.СБП.c2b = Неопределено, ЗаказНаОплату.ПараметрыОплат.СБП.b2b, ЗаказНаОплату.ПараметрыОплат.СБП.c2b);
		НазначениеПлатежа = ИнтеграцияСПлатежнымиСистемамиУНФ.ПолучитьНазначениеПлатежа(
			ПараметрыОплатСБП.ШаблоныНазначения,
			ДокументЗаказа, 
			РеквизитыОплаты);
	
		Если ЗначениеЗаполнено(НазначениеПлатежа) Тогда
			ПараметрыОплатСБП.НазначениеПлатежа = НазначениеПлатежа;
		КонецЕсли;
		
	ИначеЕсли ЗаказНаОплату.ПараметрыОплат.ИнтернетЭквайринг <> Неопределено Тогда
		
		РеквизитыОплаты	  = ИнтеграцияСПлатежнымиСистемамиУНФ.НастройкиСБПОснованияПлатежа(ДокументЗаказа);
		НазначениеПлатежа = ИнтеграцияСПлатежнымиСистемамиУНФ.ПолучитьНазначениеПлатежа(
			ЗаказНаОплату.ПараметрыОплат.ИнтернетЭквайринг.ШаблоныНазначения,
			ДокументЗаказа, 
		РеквизитыОплаты);
		
		Если ЗначениеЗаполнено(НазначениеПлатежа) Тогда
			ЗаказНаОплату.ПараметрыОплат.ИнтернетЭквайринг.НазначениеПлатежа = НазначениеПлатежа;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаказНаОплату.ПараметрыФискализации <> Неопределено Тогда 
		ДанныеДляФискализации = РозничныеПродажиСервер.ПолучитьДанныеДляФискализации(ДокументЗаказа,,,Истина);
		ДанныеДляФискализации.Интернет = Истина;
		Если Не ЗначениеЗаполнено(ДанныеДляФискализации.ПокупательEmail) Тогда
			ДанныеДляФискализации.ПокупательEmail = СведенияОКонтрагенте.ЭлектроннаяПочта;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ДанныеДляФискализации.ПокупательНомер) Тогда
			ДанныеДляФискализации.ПокупательНомер = РозничныеПродажиСервер.УбратьРазделителиВНомереТелефона(СведенияОКонтрагенте.Телефоны);
		КонецЕсли;
		Если Не ПустаяСтрока(АдресСайта) Тогда
			ДанныеДляФискализации.МестоРасчетов = АдресСайта;
		Иначе
			ДанныеДляФискализации.МестоРасчетов = ДанныеДляФискализации.АдресМагазина;
		КонецЕсли;
		ДанныеДляОблачнойКассы = ОборудованиеЧекопечатающиеОблачныеККТ.ДанныеВФорматеОблачныхККТ(ДанныеДляФискализации); 
		ЗаказНаОплату.ПараметрыФискализации.ДанныеЧека = ДанныеДляОблачнойКассы;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ШаблоныСообщений

// См. ОнлайнЗаказыПереопределяемый.ПриПроверкеИспользованияШаблоновСообщенийОнлайнЗаказов.
//
Процедура ПриПроверкеИспользованияШаблоновСообщенийОнлайнЗаказов(Используется) Экспорт
	
	Используется = Истина;
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииПараметровОтправкиСообщений.
//
Процедура ПриОпределенииПараметровОтправкиСообщений(ПараметрыОтправкиСообщений) Экспорт
	
	ПараметрыОтправкиСообщений.ПараметрыОтправкиПисем.ОтправлятьПисьмаВФорматеHTML = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОтправкаСообщений

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам.
//
Процедура ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам(Шаблоны) Экспорт 
	
	ИменаОснованийЗаказа 	  = Новый Массив;
	ПриОпределенииОснованияЗаказа(ИменаОснованийЗаказа);

	// подготовка макета шаблона
	Шаблон				  = Новый Структура("Тело, Тема, ЗначенияРеквизитов");
	МакетШаблона 		  = ПолучитьОбщийМакет("ШаблонСообщенияОплатаСБП");
	Тело 		 		  = МакетШаблона.ПолучитьТекст();
	Тема	 	 		  = НСтр("ru = 'Счет на оплату номер [ТипОснования.Номер] на сумму [ТипОснования.СуммаДокумента] руб.'");

	Тело 		 		  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Тело,
		НСтр("ru='Благодарим за заказ и просим оплатить счет'"),
		НСтр("ru='Номер заказа:'"),
		НСтр("ru='Идентификатор плательщика:'"),
		НСтр("ru='Сумма:'"),
		НСтр("ru='Для оплаты счета перейдите по ссылке'"));
		
	ЗначенияРеквизитов 	  = Новый Структура;
	ЗначенияРеквизитов.Вставить("Номер", 					"Номер");
	ЗначенияРеквизитов.Вставить("СуммаДокумента", 			"СуммаОнлайнЗаказа");
	ЗначенияРеквизитов.Вставить("Покупатель", 				"Покупатель");          
	ЗначенияРеквизитов.Вставить("КнопкаОплатитьЧерезСБП", 	"ПредставлениеСсылкиОнлайнЗаказ");          

	Шаблон.Тело				  = Тело;
	Шаблон.Тема				  = Тема;
	Шаблон.ЗначенияРеквизитов = ЗначенияРеквизитов;

	Наименование		  	  = НСтр("ru = 'Счет на оплату через СБП (%1)'");
	ИменаОснованийПлатежа 	  = Новый Массив;
	ПриОпределенииОснованияЗаказа(ИменаОснованийЗаказа);	

	Для каждого ПолноеИмя Из ИменаОснованийПлатежа Цикл
		
		МетаданныеОбъекта   = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
		ИмяОбъекта 			= МетаданныеОбъекта.Имя;
		Представление   	= МетаданныеОбъекта.Синоним;

		ТелоШаблона			= Шаблон.Тело;
		ТемаШаблона			= Шаблон.Тема;
		
		Для Каждого ПараметрШаблона Из Шаблон.ЗначенияРеквизитов Цикл
		
        	ТелоШаблона = СтрЗаменить(ТелоШаблона, 
				"[ТипОснования." + ПараметрШаблона.Ключ + "]", 
				"[" + ИмяОбъекта + "." + ПараметрШаблона.Значение + "]");
			
        	ТемаШаблона = СтрЗаменить(ТемаШаблона, 
				"[ТипОснования." + ПараметрШаблона.Ключ + "]", 
				"[" + ИмяОбъекта + "." + ПараметрШаблона.Значение + "]");
		
		КонецЦикла;

		Если ИмяОбъекта = "АктВыполненныхРабот" Тогда //Для акта недоступно поле "Покупатель"
			ТелоШаблона = СтрЗаменить(ТелоШаблона, ИмяОбъекта + ".Покупатель", ИмяОбъекта + ".Контрагент"); 
		КонецЕсли; 
		
		ШаблонДокумента 			= Новый Структура();
		ШаблонДокумента.Вставить("ТипШаблона", 				"Письмо");
		ШаблонДокумента.Вставить("ПолноеИмяТипаНазначения",	ПолноеИмя);
		ШаблонДокумента.Вставить("Наименование", 			СтрШаблон(Наименование, Представление));
		ШаблонДокумента.Вставить("Тема", 					ТемаШаблона);
		ШаблонДокумента.Вставить("Текст", 					ТелоШаблона);

		Шаблоны.Добавить(ШаблонДокумента);
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция QRКодПоРеквизитам(ДанныеШапки, СведенияОбОрганизации)
	
	РеквизитыПлатежа = НовыйРеквизитыПлатежаУФЭБС();
	
	РеквизитыПлатежа.ТекстПолучателя             = СведенияОбОрганизации.ПолноеНаименование;
	РеквизитыПлатежа.НомерСчетаПолучателя        = СведенияОбОрганизации.НомерСчета;
	РеквизитыПлатежа.НаименованиеБанкаПолучателя = Строка(СведенияОбОрганизации.Банк);
	РеквизитыПлатежа.БИКБанкаПолучателя          = СведенияОбОрганизации.БИК;
	РеквизитыПлатежа.СчетБанкаПолучателя         = СведенияОбОрганизации.КоррСчет;
	
	РеквизитыПлатежа.ИННПолучателя               = СведенияОбОрганизации.ИНН;
	РеквизитыПлатежа.КПППолучателя               = СведенияОбОрганизации.КПП;
	
	СуммаКОплате = ДанныеШапки.СуммаДокумента;
	СуммаНДС = ДанныеШапки.СуммаНДС;
	
	РеквизитыПлатежа.СуммаЧислом = СуммаКОплате;
	
	Если СуммаНДС > 0 Тогда
		ТекстПроНДС = НСтр("ru = 'В том числе НДС %1'");
		ТекстПроНДС = СтрШаблон(ТекстПроНДС, Формат(СуммаНДС, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="));
	Иначе
		ТекстПроНДС = НСтр("ru = 'Без налога (НДС)'");
	КонецЕсли;
	
	РеквизитыПлатежа.НазначениеПлатежа = СтрШаблон(НСтр("ru = 'Оплата по счету № %1 от %2. Сумма %3. %4.'"),
		ДанныеШапки.Номер,
		Формат(ДанныеШапки.Дата, "ДФ=dd.MM.yyyy"),
		Формат(СуммаКОплате, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="),
		ТекстПроНДС);
	
	QRСтрока = УправлениеПечатьюРФ.ФорматнаяСтрокаУФЭБС(РеквизитыПлатежа);
	Если ПустаяСтрока(QRСтрока) Тогда
		Возврат Неопределено; // Возникли ошибки
	КонецЕсли;
	
	Возврат QRСтрока;
	
Конецфункции

// Формирует новое описание свойств для формирования форматной строки УФЭБС.
//
// Возвращаемое значение:
//  Структура - содержит описание свойств.
//
Функция НовыйРеквизитыПлатежаУФЭБС()
	
	Возврат Новый Структура(
		"ТекстПолучателя,
		|НомерСчетаПолучателя,
		|НаименованиеБанкаПолучателя,
		|БИКБанкаПолучателя,
		|СчетБанкаПолучателя,
		|ИндексПлатежногоДокумента,
		|ИННПолучателя,
		|КПППолучателя,
		|СуммаЧислом,
		|НазначениеПлатежа");
	
КонецФункции

// Имена форм, в которые не должны быть добавлены команды
// 
// Возвращаемое значение:
//  Массив из Строка - Имена исключаемых форм
Функция ИменаИсключаемыхФорм()
	
	ИсключаемыеФормы = Новый Массив;
	ИсключаемыеФормы.Добавить("ФормаСпискаЗаказНаряда");
	
	Возврат ИсключаемыеФормы;
	
КонецФункции

Функция ТипыОбъектовСУсловиемВидимости()
	
	ТипыОбъектовСУсловиемВидимости = Новый Массив;
	ТипыОбъектовСУсловиемВидимости.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	
	Возврат ТипыОбъектовСУсловиемВидимости;
	
КонецФункции

Процедура УстановитьУсловиеВидимости(ТипыИсточников, ТипыОбъектовСУсловиемВидимости, Команды)
	
	Для Каждого ТипыОбъектаСУсловиемВидимости Из ТипыОбъектовСУсловиемВидимости Цикл
		Если ТипыИсточников.Найти(ТипыОбъектаСУсловиемВидимости) <> Неопределено Тогда
			ПодключаемыеКомандыУНФ.ДобавитьУсловиеВидимостиКомандыОбъекта(Команды, "ОнлайнЗаказы", "ОнлайнЗаказы",
				"ВидОперации", Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд, ВидСравненияКомпоновкиДанных.НеРавно);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
